print("""Послуги телефонної мережі оплачуються за таким правилом: за розмови до А хвилин в місяць - В грн.,
а розмови понад встановлену норму оплачуються з розрахунку З грн. за хвилину. 
Ввести А, ввести В, і ввести Х, що дорівнює хвилинам які користувач витратив на розмови за місяць.""")
import func

A = func.func("A:", int, lambda v: v > 0)
B = func.func("B:", int, lambda v: v > 0)
X = func.func("X:", int, lambda v: v > 0)
if X <= A:
    var = B
elif X > A:
    var = B + (X - A) * 3
print("Відповідь:", var)